; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	image3 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 174)
	(= (data Star4 image1) 159)
	(= (data Star5 image1) 211)
	(= (data Star6 image1) 229)
	(= (data Star7 image1) 265)
	(= (data Planet8 image1) 195)
	(= (data Star9 image1) 266)
	(= (data Phenomenon10 image1) 60)
	(= (data Star11 image1) 122)
	(= (data Star12 image1) 71)
	(= (data Star4 spectrograph0) 36)
	(= (data Star5 spectrograph0) 2)
	(= (data Star6 spectrograph0) 102)
	(= (data Star7 spectrograph0) 17)
	(= (data Planet8 spectrograph0) 285)
	(= (data Star9 spectrograph0) 6)
	(= (data Phenomenon10 spectrograph0) 51)
	(= (data Star11 spectrograph0) 267)
	(= (data Star12 spectrograph0) 158)
	(= (data Star4 thermograph2) 38)
	(= (data Star5 thermograph2) 274)
	(= (data Star6 thermograph2) 191)
	(= (data Star7 thermograph2) 93)
	(= (data Planet8 thermograph2) 173)
	(= (data Star9 thermograph2) 100)
	(= (data Phenomenon10 thermograph2) 45)
	(= (data Star11 thermograph2) 148)
	(= (data Star12 thermograph2) 5)
	(= (data Star4 image3) 175)
	(= (data Star5 image3) 185)
	(= (data Star6 image3) 36)
	(= (data Star7 image3) 217)
	(= (data Planet8 image3) 5)
	(= (data Star9 image3) 93)
	(= (data Phenomenon10 image3) 56)
	(= (data Star11 image3) 12)
	(= (data Star12 image3) 36)
	(= (slew_time GroundStation2 Star0) 42.05)
	(= (slew_time Star0 GroundStation2) 42.05)
	(= (slew_time GroundStation2 Star1) 49.61)
	(= (slew_time Star1 GroundStation2) 49.61)
	(= (slew_time Star3 Star0) 61.36)
	(= (slew_time Star0 Star3) 61.36)
	(= (slew_time Star3 Star1) 10.29)
	(= (slew_time Star1 Star3) 10.29)
	(= (slew_time Star3 GroundStation2) 36.55)
	(= (slew_time GroundStation2 Star3) 36.55)
	(= (slew_time Star1 Star0) 27.6)
	(= (slew_time Star0 Star1) 27.6)
	(= (slew_time Star4 Star0) 33.31)
	(= (slew_time Star0 Star4) 33.31)
	(= (slew_time Star4 Star1) 36.54)
	(= (slew_time Star1 Star4) 36.54)
	(= (slew_time Star4 GroundStation2) 26.15)
	(= (slew_time GroundStation2 Star4) 26.15)
	(= (slew_time Star4 Star3) 67.24)
	(= (slew_time Star3 Star4) 67.24)
	(= (slew_time Star5 Star0) 32.09)
	(= (slew_time Star0 Star5) 32.09)
	(= (slew_time Star5 Star1) 25.66)
	(= (slew_time Star1 Star5) 25.66)
	(= (slew_time Star5 GroundStation2) 20.52)
	(= (slew_time GroundStation2 Star5) 20.52)
	(= (slew_time Star5 Star3) 75.3)
	(= (slew_time Star3 Star5) 75.3)
	(= (slew_time Star5 Star4) 13.91)
	(= (slew_time Star4 Star5) 13.91)
	(= (slew_time Star6 Star0) 4.538)
	(= (slew_time Star0 Star6) 4.538)
	(= (slew_time Star6 Star1) 85.54)
	(= (slew_time Star1 Star6) 85.54)
	(= (slew_time Star6 GroundStation2) 43.06)
	(= (slew_time GroundStation2 Star6) 43.06)
	(= (slew_time Star6 Star3) 42.26)
	(= (slew_time Star3 Star6) 42.26)
	(= (slew_time Star6 Star4) 22.53)
	(= (slew_time Star4 Star6) 22.53)
	(= (slew_time Star6 Star5) 63.79)
	(= (slew_time Star5 Star6) 63.79)
	(= (slew_time Star7 Star0) 46.31)
	(= (slew_time Star0 Star7) 46.31)
	(= (slew_time Star7 Star1) 18.2)
	(= (slew_time Star1 Star7) 18.2)
	(= (slew_time Star7 GroundStation2) 60.18)
	(= (slew_time GroundStation2 Star7) 60.18)
	(= (slew_time Star7 Star3) 65.51)
	(= (slew_time Star3 Star7) 65.51)
	(= (slew_time Star7 Star4) 26.74)
	(= (slew_time Star4 Star7) 26.74)
	(= (slew_time Star7 Star5) 63.98)
	(= (slew_time Star5 Star7) 63.98)
	(= (slew_time Star7 Star6) 49.28)
	(= (slew_time Star6 Star7) 49.28)
	(= (slew_time Planet8 Star0) 34.16)
	(= (slew_time Star0 Planet8) 34.16)
	(= (slew_time Planet8 Star1) 12.76)
	(= (slew_time Star1 Planet8) 12.76)
	(= (slew_time Planet8 GroundStation2) 13.92)
	(= (slew_time GroundStation2 Planet8) 13.92)
	(= (slew_time Planet8 Star3) 20)
	(= (slew_time Star3 Planet8) 20)
	(= (slew_time Planet8 Star4) 3.18)
	(= (slew_time Star4 Planet8) 3.18)
	(= (slew_time Planet8 Star5) 3.591)
	(= (slew_time Star5 Planet8) 3.591)
	(= (slew_time Planet8 Star6) 4.038)
	(= (slew_time Star6 Planet8) 4.038)
	(= (slew_time Planet8 Star7) 20.84)
	(= (slew_time Star7 Planet8) 20.84)
	(= (slew_time Star9 Star0) 1.028)
	(= (slew_time Star0 Star9) 1.028)
	(= (slew_time Star9 Star1) 2.682)
	(= (slew_time Star1 Star9) 2.682)
	(= (slew_time Star9 GroundStation2) 51.92)
	(= (slew_time GroundStation2 Star9) 51.92)
	(= (slew_time Star9 Star3) 0.6415)
	(= (slew_time Star3 Star9) 0.6415)
	(= (slew_time Star9 Star4) 29.1)
	(= (slew_time Star4 Star9) 29.1)
	(= (slew_time Star9 Star5) 49.58)
	(= (slew_time Star5 Star9) 49.58)
	(= (slew_time Star9 Star6) 17.57)
	(= (slew_time Star6 Star9) 17.57)
	(= (slew_time Star9 Star7) 5.136)
	(= (slew_time Star7 Star9) 5.136)
	(= (slew_time Star9 Planet8) 55.88)
	(= (slew_time Planet8 Star9) 55.88)
	(= (slew_time Phenomenon10 Star0) 33.03)
	(= (slew_time Star0 Phenomenon10) 33.03)
	(= (slew_time Phenomenon10 Star1) 77.08)
	(= (slew_time Star1 Phenomenon10) 77.08)
	(= (slew_time Phenomenon10 GroundStation2) 22.28)
	(= (slew_time GroundStation2 Phenomenon10) 22.28)
	(= (slew_time Phenomenon10 Star3) 20.17)
	(= (slew_time Star3 Phenomenon10) 20.17)
	(= (slew_time Phenomenon10 Star4) 3.589)
	(= (slew_time Star4 Phenomenon10) 3.589)
	(= (slew_time Phenomenon10 Star5) 41.76)
	(= (slew_time Star5 Phenomenon10) 41.76)
	(= (slew_time Phenomenon10 Star6) 10.15)
	(= (slew_time Star6 Phenomenon10) 10.15)
	(= (slew_time Phenomenon10 Star7) 7.886)
	(= (slew_time Star7 Phenomenon10) 7.886)
	(= (slew_time Phenomenon10 Planet8) 30.36)
	(= (slew_time Planet8 Phenomenon10) 30.36)
	(= (slew_time Phenomenon10 Star9) 10.7)
	(= (slew_time Star9 Phenomenon10) 10.7)
	(= (slew_time Star11 Star0) 39.71)
	(= (slew_time Star0 Star11) 39.71)
	(= (slew_time Star11 Star1) 19.8)
	(= (slew_time Star1 Star11) 19.8)
	(= (slew_time Star11 GroundStation2) 30.86)
	(= (slew_time GroundStation2 Star11) 30.86)
	(= (slew_time Star11 Star3) 82.36)
	(= (slew_time Star3 Star11) 82.36)
	(= (slew_time Star11 Star4) 35.4)
	(= (slew_time Star4 Star11) 35.4)
	(= (slew_time Star11 Star5) 88.98)
	(= (slew_time Star5 Star11) 88.98)
	(= (slew_time Star11 Star6) 9.905)
	(= (slew_time Star6 Star11) 9.905)
	(= (slew_time Star11 Star7) 27.58)
	(= (slew_time Star7 Star11) 27.58)
	(= (slew_time Star11 Planet8) 56.6)
	(= (slew_time Planet8 Star11) 56.6)
	(= (slew_time Star11 Star9) 40.03)
	(= (slew_time Star9 Star11) 40.03)
	(= (slew_time Star11 Phenomenon10) 25.78)
	(= (slew_time Phenomenon10 Star11) 25.78)
	(= (slew_time Star12 Star0) 1.849)
	(= (slew_time Star0 Star12) 1.849)
	(= (slew_time Star12 Star1) 42.98)
	(= (slew_time Star1 Star12) 42.98)
	(= (slew_time Star12 GroundStation2) 1.062)
	(= (slew_time GroundStation2 Star12) 1.062)
	(= (slew_time Star12 Star3) 39.33)
	(= (slew_time Star3 Star12) 39.33)
	(= (slew_time Star12 Star4) 17.58)
	(= (slew_time Star4 Star12) 17.58)
	(= (slew_time Star12 Star5) 43.49)
	(= (slew_time Star5 Star12) 43.49)
	(= (slew_time Star12 Star6) 6.532)
	(= (slew_time Star6 Star12) 6.532)
	(= (slew_time Star12 Star7) 2.139)
	(= (slew_time Star7 Star12) 2.139)
	(= (slew_time Star12 Planet8) 33.83)
	(= (slew_time Planet8 Star12) 33.83)
	(= (slew_time Star12 Star9) 30.43)
	(= (slew_time Star9 Star12) 30.43)
	(= (slew_time Star12 Phenomenon10) 41.43)
	(= (slew_time Phenomenon10 Star12) 41.43)
	(= (slew_time Star12 Star11) 43.06)
	(= (slew_time Star11 Star12) 43.06)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star4 image3)
	(have_image Star5 image3)
	(have_image Star9 image3)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 174 to 118.12, (fuel-used) from 0 to 55.88
   goals met: 0 of 3
3. (turn_to satellite0 star6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 118.12 to 100.55, (fuel-used) from 55.88 to 73.45
   goals met: 0 of 3
4. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 100.55 to 96.012, (fuel-used) from 73.45 to 77.988
   goals met: 0 of 3
5. (turn_to satellite0 star1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 96.012 to 68.412, (fuel-used) from 77.988 to 105.588
   goals met: 0 of 3
6. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 3
7. (turn_to satellite0 star4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 68.412 to 31.872, (fuel-used) from 105.588 to 142.128
   goals met: 0 of 3
8. (take_image satellite0 star4 instrument0 image3)
   added: (have_image star4 image3)
   changed: (data_capacity satellite0) from 1000 to 825, (data-stored) from 0 to 175
   goals met: 1 of 3
9. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 31.872 to 17.962, (fuel-used) from 142.128 to 156.038
   goals met: 1 of 3
10. (take_image satellite0 star5 instrument0 image3)
   added: (have_image star5 image3)
   changed: (data_capacity satellite0) from 825 to 640, (data-stored) from 175 to 360
   goals met: 2 of 3
11. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 17.962 to 14.371, (fuel-used) from 156.038 to 159.629
   goals met: 2 of 3
12. (turn_to satellite0 star6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 14.371 to 10.333, (fuel-used) from 159.629 to 163.667
   goals met: 2 of 3
13. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 10.333 to 5.795, (fuel-used) from 163.667 to 168.205
   goals met: 2 of 3
14. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 5.795 to 4.767, (fuel-used) from 168.205 to 169.233
   goals met: 2 of 3
15. (take_image satellite0 star9 instrument0 image3)
   added: (have_image star9 image3)
   changed: (data_capacity satellite0) from 640 to 547, (data-stored) from 360 to 453
   goals met: 3 of 3
